Catalogs/упТипыДокументовТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыДокументовТСВодителей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументВыдается</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОбъектДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОбОкончанииСрокаДействия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПредупреждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКоличествоОбъектовДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВодителей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКоличествоОбъектовДокументовТСВодителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСрокДействияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упСрокДействияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСрокДействияДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СрокУказываетсяВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеограниченныйСрок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упОбъектДокументовТСВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упОбъектДокументовТСВодителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТранспортноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТСВодитель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыДокументовТСВодителей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредупреждатьОбОкончанииСрокаДействияПриИзменении(Элемент)

	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументВыдаетсяПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	// Нет.
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если Объект.СрокДействия = ПредопределенноеЗначение("Перечисление.упСрокДействияДокумента.ФиксированныйСрок") Тогда 
		Элементы.ПериодДействия.Доступность                        = Истина;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Истина;
	ИначеЕсли Объект.СрокДействия = ПредопределенноеЗначение("Перечисление.упСрокДействияДокумента.НеограниченныйСрок") Тогда 
		Элементы.ПериодДействия.Доступность                        = Ложь;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Ложь;
	Иначе	
		Элементы.ПериодДействия.Доступность                        = Ложь;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Истина;
	КонецЕсли;	

	Элементы.ГруппаИнтервалПредупреждения.Доступность = Объект.ПредупреждатьОбОкончанииСрокаДействия И Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность;
	Если Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.ТранспортноеСредство") Тогда 
		Элементы.КоличествоТС.Доступность        = Истина;
		Элементы.КоличествоВодителей.Доступность = Ложь;
	ИначеЕсли Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.Водитель") Тогда 
		Элементы.КоличествоТС.Доступность        = Ложь;
		Элементы.КоличествоВодителей.Доступность = Истина;
	ИначеЕсли Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.ТСВодитель") Тогда 
		Элементы.КоличествоТС.Доступность        = Истина;
		Элементы.КоличествоВодителей.Доступность = Истина;
	Иначе	
		Элементы.КоличествоТС.Доступность        = Ложь;
		Элементы.КоличествоВодителей.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
